<?php
/**
 * Created by PhpStorm.
 * User: lxwn
 * Date: 2018/5/15
 * Time: 下午2:37
 */

return array(
	'code'  =>  array(
		//---   成功  ---//
		'1'         =>  '成功',
		//----  事务 ---//
		//---   其他  ---//
		'30001' =>  '请先登录',
		'30002' =>  '无操作权限',
		//---   失败  ---//
		'40000' =>  '失败',
		//---   错误  ---//
		'50000' =>  '错误',
		'50001' =>  '验证码错误',
		//-----     ----//
		//---   不存在  ---//
		'70000' =>  '不存在',
		'70001' =>  '账号或密码不存在',
		'70002' =>  '数据不存在',
		'71000' =>  '控制器不存在',
		'72000' =>  '方法不存在',
		//---   存在  ---//
		'80000' =>  '已存在',
		'80001' =>  '数据已存在',
		'80002' =>  '账号已存在',
		//---   缺失  ---//
		'99999' =>  '参数缺失',
	)
);